#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

int main()
{
	char a=3;
	//a的二进制序列：00000011
	char b = 127;
	//b的二进制序列：01111111
	char c = a + b;
	//当进行运算的时候，由于char类型小于int类型，所以发生整型提升
	// 注：提升时根据符号位来补（1补1，0补0）
	//a：00000000000000000000000000000011
	//b：00000000000000000000000001111111
	//c：00000000000000000000000010000010
	//由于c是char类型所以发生截断，c：100000010
	//此时为补码形式，需要输出原码 
	//c：11111111111111111111111110000010 - 补码
	//c：11111111111111111111111110000001 - 反码
	//c：10000000000000000000000001111110 - 原码
	printf("%d\n", c);

	return 0;
}